Autodesk.Revit.Creation.FamilyInstanceCreationData.#ctor(Autodesk.Revit.DB.FamilySymbol,System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ})
symbol:  A FamilySymbol object that represents the type of the instance that is to be inserted.
adaptivePoints:  The adaptive points where the adaptive instance is to be initialized.